const notifications = {
  "notifications": {
    "login": {
      "auth": {
        "success": "Авторизация прошла успешно",
        "error": "Не удалось авторизироваться"
      },
    },
    "register": {
      "create": {
        "success": "Создан новый пользователь",
        "error": "Не удалось зарегистрировать нового пользователя"
      },
    },
    "profile": {
      "update": {
        "success": "Профиль пользователя успешно обновлен",
        "error": "Не удалось обновить профиль пользователя"
      },
    },
    "settings": {
      "changeEmail": {
        "success": "Электронная почта пользователя успешно обновлена",
        "error": "Не удалось обновить электронную почту пользователя"
      },
      "changePassword": {
        "success": "Пароль пользователя успешно обновлен",
        "error": "Не удалось обновить пароль пользователя"
      },
      "deleteAccount": {
        "success": "Учетная запись пользователя успешно удалена",
        "error": "Не удалось удалить учетную запись пользователя"
      },
    },
    "personalInfo": {
      "create": {
        "success": "Создана персональная информация",
        "error": "Не удалось создать личную информацию"
      },
      "update": {
        "success": "Личная информация обновлена",
        "error": "Не удалось обновить личную информацию"
      }
    },
    "personalHobbies": {
      "create": {
        "success": "Личные хобби созданы",
        "error": "Не удалось создать личные хобби"
      },
      "update": {
        "success": "Личные хобби обновлены",
        "error": "Не удалось обновить личные хобби"
      }
    },
    "personalLanguages": {
      "create": {
        "success": "Личные языки созданы",
        "error": "Не удалось создать личные языки"
      },
      "update": {
        "success": "Личные языки обновлены",
        "error": "Не удалось обновить личные языки"
      }
    },
    "personalExperiences": {
      "create": {
        "success": "Личный опыт, созданный",
        "error": "Не удалось создать личный опыт"
      },
      "update": {
        "success": "Личный опыт обновлен",
        "error": "Не удалось обновить создать личный опыт"
      }
    },
    "personalEducation": {
      "create": {
        "success": "Личное образование создано",
        "error": "Не удалось создать личное образование"
      },
      "update": {
        "success": "Личное образование обновлено",
        "error": "Не удалось обновить личное образование"
      }
    },
    "personalCourses": {
      "create": {
        "success": "Персональные курсы созданы",
        "error": "Не удалось создать персональные курсы"
      },
      "update": {
        "success": "Персональные курсы обновлены",
        "error": "Не удалось обновить персональные курсы"
      }
    },
    "personalSkills": {
      "create": {
        "success": "Личные навыки созданы",
        "error": "Не удалось создать личные навыки"
      },
      "update": {
        "success": "Личные навыки обновлены",
        "error": "Не удалось обновить личные навыки"
      }
    },
    "personalTools": {
      "create": {
        "success": "Персональные инструменты созданы",
        "error": "Не удалось создать персональные инструменты"
      },
      "update": {
        "success": "Персональные инструменты обновлены",
        "error": "Не удалось обновить персональные инструменты"
      }
    }
  }
};

export default notifications;