const notifications = {
  "notifications": {
    "login": {
      "auth": {
        "success": "Авторизація пройшла успішно",
        "error": "Не вдалося авторизуватися"
      },
    },
    "register": {
      "create": {
        "success": "Новий користувач створено",
        "error": "Не вдалося зареєструвати нового користувача"
      },
    },
    "personalInfo": {
      "create": {
        "success": "Особисту інформацію створено",
        "error": "Не вдалося створити особисту інформацію"
      },
      "update": {
        "success": "Особисту інформацію оновлено",
        "error": "Не вдалося оновити особисту інформацію"
      }
    },
    "personalHobbies": {
      "create": {
        "success": "Особисті хобі створено",
        "error": "Не вдалося створити особисті хобі"
      },
      "update": {
        "success": "Особисті хобі оновлено",
        "error": "Не вдалося оновити особисті хобі"
      }
    },
    "personalLanguages": {
      "create": {
        "success": "Персональні мови створено",
        "error": "Не вдалося створити персональні мови"
      },
      "update": {
        "success": "Персональні мови оновлено",
        "error": "Не вдалося оновити персональні мови"
      }
    },
    "personalExperiences": {
      "create": {
        "success": "Особистий досвід створено",
        "error": "Не вдалося створити особистий досвід"
      },
      "update": {
        "success": "Особистий досвід оновлено",
        "error": "Не вдалося оновити особистий досвід"
      }
    },
    "personalEducation": {
      "create": {
        "success": "Персональну освіту створено",
        "error": "Не вдалося створити персональну освіту"
      },
      "update": {
        "success": "Персональну освіту оновлено",
        "error": "Не вдалося оновити персональну освіту"
      }
    },
    "personalCourses": {
      "create": {
        "success": "Персональні курси створено",
        "error": "Не вдалося створити персональні курси"
      },
      "update": {
        "success": "Персональні курси оновлено",
        "error": "Не вдалося оновити персональні курси"
      }
    },
    "personalSkills": {
      "create": {
        "success": "Особисті навички створено",
        "error": "Не вдалося створити особисті навички"
      },
      "update": {
        "success": "Особисті навички оновлено",
        "error": "Не вдалося оновити особисті навички"
      }
    },
    "personalTools": {
      "create": {
        "success": "Особисті інструменти створено",
        "error": "Не вдалося створити особисті інструменти"
      },
      "update": {
        "success": "Особисті інструменти оновлено",
        "error": "Не вдалося оновити особисті інструменти"
      }
    }
  }
};

export default notifications;