const settings = {
  "Settings": {
    "layout": {
      "title": "Налаштування",
      "description": "Налаштування - опис"
    },
    "title": "Налаштування",
    "subTitle": "Керування налаштуваннями акаунту.",
    "changeEmail": {
      "title": "Изменить адрес электронной почты",
      "button": "Изменить адрес электронной почты",
      "form": {
        "email": {
          "label": "Нова електронна пошта",
          "placeholder": "Введіть електронну пошту",
          "errors": {
            "required": "Будь ласка, введіть електронну пошту!",
            "maxLength": "Має містити не більше {maxLength} символів!",
            "pattern": "Недійсна адреса електронної пошти! (Наприклад: example@mail.com)",
            "alreadyExists": "Електронна адреса вже існує!",
          }
        },
        "password": {
          "label": "Поточний пароль",
          "placeholder": "Введіть пароль",
          "errors": {
            "required": "Будь ласка, введіть пароль!",
            "minLength": "Має містити щонайменше {minLength} символів!",
            "maxLength": "Має містити не більше {maxLength} символів!",
            "uppercase": "Повинно містити хоча б одну велику літеру!",
            "number": "Повинно містити хоча б одну цифру!",
            "currentPassword": "Недійсний поточний пароль",
          }
        },
        "submitButton": "Изменить адрес электронной почты",
      }
    },
    "changePassword": {
      "title": "Змінити пароль",
      "button": "Змінити пароль",
      "form": {
        "password": {
          "label": {
            "currentPassword": "Поточний пароль",
            "newPassword": "Новий пароль",
            "confirmPassword": "Підтвердити пароль",
          },
          "placeholder": "Введіть пароль",
          "errors": {
            "required": "Будь ласка, введіть пароль!",
            "minLength": "Має містити щонайменше {minLength} символів!",
            "maxLength": "Має містити не більше {maxLength} символів!",
            "uppercase": "Повинно містити хоча б одну велику літеру!",
            "number": "Повинно містити хоча б одну цифру!",
            "currentPassword": "Недійсний поточний пароль",
            "confirmPassword": "Паролі не збігаються",
          }
        },
        "submitButton": "Змінити пароль",
      }
    },
    "deleteAccount": {
      "title": "Видалити акаунт",
      "button": "Видалити акаунт",
      "modal": {
        "title": "Удалить акаунт",
        "form": {
          "userName": {
            "label": 'Напишіть свій "username" для підтвердження видалення акаунту',
            "placeholder": "Введіть ім'я користувача",
            "errors": {
              "required": "Будь ласка, введіть своє ім'я користувача!",
              "pattern": "Неправильний формат імені користувача! (Ім'я користувача може складатися з латинських букв, цифр або _)",
              "minLength": "Має містити щонайменше {minLength} символів!",
              "maxLength": "Має містити не більше {maxLength} символів!",
            }
          },
          "alert": {
            "error": "Ім'я користувача неправильне!",
          },
          "submitButton": "Удалить аккаунт",
        },
      }
    }
  },
};

export default settings;